const t={map:'[{"html":["0.0"],"tip":["1.0"],"一":["1.1","2.1","6.1"],"二":["1.4","2.6","6.5"],"typescript入门":["2.0"],"三":["2.17","6.6"],"四":["2.20","6.14"],"vue":["3.0"],"关于自己":["4.0"],"sparkles":["4.1"],"rocket":["4.2"],"more":["6.0"],"场景一":["6.15"],"场景二":["6.16"],"自用mac软件整理":["7.0"],"图像处理":["7.1"],"截图":["7.2"],"画图":["7.3"],"图床":["7.4"],"前端开发软件":["7.5"],"编辑器":["7.6"],"接口调试":["7.7"],"数据库":["7.8"],"工具":["7.9"],"终端":["7.10"],"菜单栏":["7.11"],"解压缩":["7.12"],"视频播放器":["7.13"],"系统清理":["7.14"],"分屏":["7.15"],"剪切板":["7.16"],"列举一些实用的npm包":["8.0"]},{"0":["2.12"],"1":["1.2","1.3","2.2","2.3","2.4","2.12","2.18","2.21","6.2","6.3","6.4","6.7","8.1","8.2","8.3","8.4","8.5","8.6","8.7"],"2":["1.3","1.5","1.6","1.7","1.8","1.9","1.10","1.11","2.5","2.7","2.8","2.9","2.10","2.11","2.12","2.13","2.14","2.15","2.16","2.19","2.22","6.3","6.8","8.8","8.9","8.10","8.11","8.14"],"3":["1.7","2.18","2.19","6.4","6.7","6.8","6.9","6.10","6.11","6.12","6.13","8.11","8.12","8.13","8.14","8.15","8.16","8.17"],"4":["2.10","2.21","2.22","6.10","8.16"],"5":["2.11","6.11","6.12","8.17"],"6":["1.10","2.12"],"7":["1.11","2.13"],"8":["2.14"],"9":["2.15"],"10":["2.16"],"mysql":["1.0"],"是最流行的关系型数据库管理系统":["1.0"],"基础知识":["1.1","6.1"],"rdbms":["1.3"],"mysql使用":["1.4"],"查看已有的数据库":["1.7"],"创建数据表":["1.10"],"bash":["1.10","6.2","6.7","6.10","6.11"],"create":["1.10"],"typescript是什么":["2.1"],"typescript基本类型":["2.6"],"enum类型":["2.12"],"使用枚举我们可以定义一些带名字的常量":["2.12"],"使用枚举可以清晰地表达意图或创建一组有区别的用例":["2.12"],"typescript":["2.12","2.17","2.20"],"支持数字的和基于字符串的枚举":["2.12"],"数字枚举":["2.12"],"ts":["2.12","2.21"],"enum":["2.12"],"direction":["2.12"],"sunday":["2.12"],"monday":["2.12"],"friday":["2.12"],"let":["2.12"],"dir0":["2.12"],"dir1":["2.12"],"类型断言":["2.18"],"有时候你会遇到这样的情况":["2.18"],"你会比":["2.18"],"非空断言":["2.19"],"在上下文中当类型检查器无法断定类型时":["2.19"],"一个新的后缀表达式操作符":["2.19"],"in":["2.21"],"关键字":["2.21","2.22"],"interface":["2.21"],"typeof":["2.22"],"类型保护只支持两种形式":["2.22"],"94年出生":["4.0"],"当下":["4.1"],"未来":["4.2"],"git使用":["6.0"],"git环境配置":["6.2"],"查看git版本":["6.2"],"基本概念":["6.3"],"git工作流程图":["6.4"],"git工作流":["6.4"],"命令如下":["6.4"],"仓库管理":["6.5"],"git常用命令":["6.6"],"添加":["6.7"],"删除文件":["6.7"],"分支":["6.9"],"标签":["6.10"],"撤销":["6.11"],"git":["6.11"],"restore":["6.11"],"回滚":["6.12"],"回滚某次":["6.12"],"实际业务场景":["6.14"],"bug分支":["6.15"],"场景描述":["6.15","6.16"],"当你接到一个修复一个代号101的bug的任务时":["6.15"],"很自然地":["6.15"],"你想创建一个分支issue":["6.15"],"101来修复它":["6.15"],"但是":["6.15"],"当前正在dev上进行的工作还没有提交":["6.15"],"并不是你不想提交":["6.15"],"而是工作只进行到一半":["6.15"],"还没法提交":["6.15"],"预计完成还需1天时间":["6.15"],"必须在两个小时内修复该bug":["6.15"],"怎么办":["6.15"],"git还提供了一个":["6.15"],"选择某个提交进行合并":["6.16"],"ishot":["7.2"],"目前一直在用的截图软件":["7.2"],"excalidraw":["7.3"],"picgo":["7.4"],"vscode":["7.6"],"postman":["7.7"],"navicat":["7.8"],"iterm2":["7.10"],"hidden":["7.11"],"keka":["7.12"],"iina":["7.13"],"clean":["7.14"],"magnet":["7.15"],"paste":["7.16"],"用":["8.15"],"通过":["8.16"],"fnm":["8.16"],"来指定":["8.16"]},{"1":["1.5","2.7","8.9","8.13"],"2":["2.3","6.4","8.3"],"3":["2.9","8.4"],"4":["1.8","8.5"],"5":["1.9","8.6"],"6":["6.13","8.7"],"在":["1.0","2.13"],"web":["1.0"],"概念":["1.2"],"mysql":["1.2"],"术语":["1.3"],"rdmbs":["1.3"],"数据库":["1.3"],"创建数据库":["1.6"],"sql":["1.7"],"show":["1.7"],"databases":["1.7"],"删除数据库":["1.8"],"选择数据库":["1.9"],"table":["1.10"],"name":["1.10","2.21"],"column":["1.10"],"删除数据表":["1.11"],"bash":["1.11","6.8","6.9","6.12","6.15"],"typescript":["2.1","2.2","2.13","2.14","2.18"],"ts与js的区别":["2.2"],"javascript":["2.2"],"安装typescript":["2.4"],"将ts转成js":["2.5"],"boolean类型":["2.7"],"array类型":["2.10"],"ts":["2.10","2.19"],"tuple类型":["2.11"],"数组一般由同种类型的值组成":["2.11"],"dir2":["2.12"],"已上代码对应的es5代码如下":["2.12"],"js":["2.12"],"use":["2.12","8.16"],"strict":["2.12"],"var":["2.12"],"function":["2.12"],"any类型":["2.13"],"null与undefined类型":["2.14"],"里":["2.14"],"void类型":["2.15"],"void":["2.15"],"类型某种程度上是与":["2.15"],"never类型":["2.16"],"never":["2.16"],"断言":["2.17"],"更了解某个值的详细信息":["2.18"],"通常这会发生在你清楚地知道一个实体具有比它现有类型更确切的类型":["2.18"],"类型断言有两种形式":["2.18"],"语法":["2.18"],"可以用于断言操作对象是非":["2.19"],"null":["2.19"],"和非":["2.19"],"undefined":["2.19"],"类型":["2.19"],"类型守护":["2.20"],"admin":["2.21"],"string":["2.21"],"privileges":["2.21"],"v":["2.22"],"typename":["2.22"],"和":["2.22"],"文科男一枚":["4.0"],"git":["6.2","6.7","6.9","6.10","6.12","6.15"],"version":["6.2"],"配置个人的用户名称和电子邮件地址":["6.2"],"工作区":["6.3"],"本地项目存放文件的位置":["6.3"],"暂存区":["6.3"],"clone":["6.4"],"克隆":["6.4"],"从远程仓库中克隆代码到本地仓库":["6.4"],"checkout":["6.4"],"检出":["6.4"],"查看工作区的文件状态":["6.7"],"status":["6.7","6.15"],"添加工作区的所有文件到暂存区":["6.7"],"提交代码":["6.8"],"提交代码到仓库区":["6.8"],"查看本地所有分支":["6.9"],"branch":["6.9"],"查看所以标签":["6.10"],"tag":["6.10"],"新建一个标签":["6.10"],"撤销工作区tracked过所有文件的修改":["6.11"],"add":["6.11"],"的逆操作":["6.11"],"某个连续的提交":["6.12"],"生成新的提交记录":["6.12"],"revert":["6.12"],"stash":["6.15"],"功能":["6.15"],"可以把当前工作现场":["6.15"],"储藏":["6.15"],"起来":["6.15"],"等以后恢复现场后继续工作":["6.15"],"现在":["6.15"],"用":["6.15"],"查看工作区":["6.15"],"就是干净的":["6.15"],"除非有没有被git管理的文件":["6.15"],"对于多分支的代码库":["6.16"],"将代码从一个分支转移到另一个分支是常见需求":["6.16"],"支持滚动截图":["7.2"],"录屏":["7.2"],"开源软件":["7.3"],"人气很高":["7.3"],"目前一直在用的图床工具":["7.4"],"webstorm":["7.6"],"premium":["7.8"],"openinterminal":["7.10"],"bar":["7.11"],"一个超轻的":["7.11"],"在app":["7.12"],"苹果":["7.13"],"my":["7.14"],"切换":["8.1","8.12"],"弃用":["8.8"],"基本命令":["8.11"],"shell":["8.11","8.16","8.17"],"稳定版本":["8.11"],"配置":["8.14"],"fnm":["8.14","8.15","8.17"],"所需的环境变量到":["8.14"],"安装":["8.15"],"node":["8.15","8.16"],"版本":["8.16"],"使用系统版本":["8.16"],"卸载":["8.17"]},{"1":["6.15"],"4":["6.4"],"18":["8.16"],"应用方面":["1.0"],"是开源的":["1.2"],"目前隶属于":["1.2"],"oracle":["1.2"],"数据库是一些关联表的集合":["1.3"],"数据表":["1.3","1.10"],"表是数据的矩阵":["1.3"],"在一个数据库中的表看起来像一个简单的电子表格":["1.3"],"mysql连接":["1.5"],"bash":["1.6","1.8","1.9","2.4","2.5","8.14"],"create":["1.6"],"控制台会打印出已经创建的数据库":["1.7"],"database":["1.7"],"eggapi":["1.7"],"drop":["1.8","1.11"],"use":["1.9"],"type":["1.10","2.21"],"创建名为":["1.10"],"newtable":["1.10"],"的":["1.10"],"sql":["1.10"],"table":["1.11"],"是一种由微软开发的自由和开源的编程语言":["2.1"],"的超集用于解决大型项目的代码复杂性":["2.2"],"一种脚本语言":["2.2"],"环境配置":["2.3"],"ts":["2.7","2.9","2.16","2.18"],"let":["2.7","2.10","2.18"],"number类型":["2.8"],"string类型":["2.9"],"list":["2.10"],"number":["2.10","2.22"],"但有时我们需要在单个变量中存储不同类型的值":["2.11"],"这时候我们就可以使用元组":["2.11"],"元组可用于定义具有有限数量的未命名属性的类型":["2.11"],"中":["2.13"],"任何类型都可以被归为":["2.13"],"any":["2.13","2.15","2.18"],"undefined":["2.14"],"和":["2.14"],"null":["2.14"],"类型相反的":["2.15"],"它表示没有任何类型":["2.15"],"类型表示的是那些永不存在的值的类型":["2.16"],"somevalue":["2.18"],"this":["2.18"],"is":["2.18"],"function":["2.19"],"myfunc":["2.19"],"maybestring":["2.19"],"string":["2.19","2.22"],"employee":["2.21"],"startdate":["2.21"],"date":["2.21"],"unknownemployee":["2.21"],"必须是":["2.22"],"boolean":["2.22"],"或":["2.22","8.14"],"symbol":["2.22"],"但是":["2.22"],"typescript":["2.22"],"毕业于河南科技大学":["4.0"],"config":["6.2"],"global":["6.2"],"user":["6.2"],"name":["6.2"],"eugeniocode":["6.2"],"index":["6.3"],"stage":["6.3"],"顾名思义就是暂时存放文件的地方":["6.3"],"从本地仓库中检出一个仓库分支然后进行修订":["6.4"],"add":["6.4","6.7"],"添加":["6.4"],"在提交前先将代码提交到暂存区":["6.4"],"commit":["6.4","6.12"],"添加指定文件到暂存区":["6.7"],"多个文件用空格隔开":["6.7"],"没有":["6.8"],"m会进入vim编辑器":["6.8"],"查看本地和远程所有分支":["6.9"],"a":["6.9"],"tab":["6.10"],"xxx":["6.10"],"删除本地标签":["6.10"],"staged":["6.11"],"简写":["6.11"],"s":["6.11"],"id":["6.12"],"场景":["6.12"],"提交了错误代码":["6.12"],"想要回滚到某次提交":["6.12"],"变基":["6.13"],"因此可以放心地创建分支来修复bug":["6.15"],"首先确定要在哪个分支上修复bug":["6.15"],"假定需要在":["6.15"],"master":["6.15"],"分支上修复":["6.15"],"就从":["6.15"],"创建临时分支":["6.15"],"checkout":["6.15"],"b":["6.15"],"当我们在一个分支上开发了两个功能时":["6.16"],"代码快要合并时被告知有一个功能不需要了":["6.16"],"图钉等":["7.2"],"一直在维护":["7.3"],"操作简洁":["7.3"],"图片存储在github仓库":["7.4"],"robo":["7.8"],"开源软件":["7.10"],"macos":["7.11"],"store里面下载需要30元":["7.12"],"mac":["7.13","7.14"],"一款mac下的窗口分屏软件":["7.15"],"for":["7.16"],"npm":["8.1"],"nrm":["8.2"],"的安装":["8.2"],"查看可选npm源":["8.3"],"切换npm源":["8.4"],"增加npm源":["8.5"],"删除npm源":["8.6"],"测试npm源速度":["8.7"],"切换":["8.8"],"安装":["8.9","8.13"],"n":["8.9","8.11"],"查看可用的":["8.10"],"stable":["8.11"],"最新版":["8.11"],"node":["8.12"],"shell":["8.15"],"lts":["8.15"],"system":["8.16"],"使用":["8.16"],"所安装":["8.16"],"且版本号为":["8.16"],"brew":["8.17"],"uninstall":["8.17"]},{"1":["2.10","8.16"],"2":["6.15"],"3":["2.12"],"5":["6.4"],"21":["8.16"],"101":["6.15"],"是最好的":["1.0"],"rdbms":["1.0"],"旗下产品":["1.2"],"列":["1.3"],"一列":["1.3"],"数据元素":["1.3"],"bash":["1.5","6.13","8.2","8.3","8.4","8.5","8.6","8.7"],"database":["1.6","1.8"],"要创建的数据库名":["1.6"],"information":["1.7"],"schema":["1.7"],"mailsystem":["1.7"],"数据库名":["1.8","1.9"],"if":["1.10"],"not":["1.10","2.19"],"exists":["1.10"],"name":["1.11"],"它是":["2.1"],"用于创建动态网页":["2.2"],"可以在编译期间发现并纠正错误":["2.2"],"作为一种解释型语言":["2.2"],"npm":["2.4"],"tsc":["2.5"],"issuccess":["2.7"],"ts":["2.8","2.11","2.22"],"let":["2.9","2.11"],"字符串枚举":["2.12"],"dir":["2.12"],"常量枚举":["2.12"],"除了数字枚举和字符串枚举之外":["2.12"],"还有一种特殊的枚举":["2.12"],"类型":["2.13"],"这让":["2.13"],"两者有各自的类型分别为":["2.14"],"当一个函数没有返回值时":["2.15"],"通常会见到其返回值类型是":["2.15"],"返回never的函数必须存在无法达到的终点":["2.16"],"function":["2.16","2.21","2.22"],"a":["2.18"],"string":["2.18"],"strlength":["2.18"],"number":["2.18"],"type":["2.19"],"is":["2.19"],"printemployeeinformation":["2.21"],"emp":["2.21"],"并不会阻止你与其它字符串比较":["2.22"],"语言不会把那些表达式识别为类型保护":["2.22"],"padleft":["2.22"],"value":["2.22"],"稀里糊涂就成了一个前端小菜鸡":["4.0"],"email":["6.2"],"通过add命令将工作区的文件添加到缓冲区":["6.3"],"本地仓库":["6.3"],"repository":["6.3"],"提交":["6.4"],"提交到本地仓库":["6.4"],"本地仓库中保存修改的各个历史版本":["6.4"],"fetch":["6.4"],"抓取":["6.4"],"file1":["6.7"],"file2":["6.7"],"删除工作区指定文件":["6.7"],"git":["6.8"],"commit":["6.8","6.11","6.15"],"m":["6.8","6.15"],"新建一个分支并停留在当前分支":["6.9"],"d":["6.10"],"标签名":["6.10"],"删除远程标签":["6.10"],"将当前工作区":["6.11"],"回滚":["6.11"],"到某次":["6.11"],"版本":["6.11","8.15"],"但是此时其他团队成员也对该分支进行了合并":["6.12"],"如果使用了":["6.12"],"reset":["6.12"],"后则需要其他人重新再合并一遍":["6.12"],"此时应该使用":["6.12"],"issue":["6.15"],"修复bug":["6.15"],"然后提交":["6.15"],"add":["6.15"],"readme":["6.15"],"txt":["6.15"],"fix":["6.15"],"bug":["6.15"],"这个时候":["6.16"],"我们只需要将开发分支的部分提交合并到master分支":["6.16"],"腾讯出的截图软件":["7.2"],"就叫":["7.2"],"有很多素材库可直接使用":["7.3"],"很棒的手画风格":["7.3"],"上传成功后会自动生成markdown语法的图片链接":["7.4"],"3t":["7.8"],"能够使用vscode快速打开项目":["7.10"],"实用程序":["7.11"],"有助于隐藏菜单栏图标":["7.11"],"在官网免费下载":["7.12"],"平台上最强的好用万能视频播放器":["7.13"],"x":["7.14"],"让当前活动窗口快速变换位置到屏幕左边":["7.15"],"mac是mac平台上一款专业的剪切板记录增强工具":["7.16"],"源的工具":["8.1"],"node":["8.8","8.10"],"shell":["8.9"],"lastest":["8.11"],"指定版本":["8.11"],"版本的工具":["8.12"],"fnm":["8.13"],"zsh":["8.14"],"配置文件中":["8.14"],"以":["8.14"],"install":["8.15"],"的":["8.16"],"程序":["8.16"],"移除":["8.17"],"目录":["8.17"]},{"1":["6.16"],"3":["2.10","6.15"],"6":["6.4"],"15":["8.11"],"16":["8.11"],"relational":["1.0"],"database":["1.0"],"支持大型的数据库":["1.2"],"可以处理拥有上千万条记录的大型数据库":["1.2"],"包含了相同类型的数据":["1.3"],"例如邮政编码的数据":["1.3"],"行":["1.3"],"mysql":["1.5","1.7"],"u":["1.5"],"创建":["1.6"],"newtable":["1.6","1.7","1.8","1.11"],"performance":["1.7"],"删除":["1.8","1.11"],"使用":["1.9"],"eggapi":["1.9"],"id":["1.10"],"int":["1.10"],"unsigned":["1.10"],"auto":["1.10"],"increment":["1.10"],"title":["1.10"],"javascript":["2.1","2.12"],"只能在运行时发现错误":["2.2"],"强类型":["2.2"],"支持静态和动态类型":["2.2"],"install":["2.4"],"index":["2.5"],"boolean":["2.7"],"true":["2.7"],"let":["2.8","2.14"],"count":["2.8"],"name":["2.9"],"newlist":["2.10"],"tupletype":["2.11"],"number":["2.11"],"它是使用":["2.12"],"const":["2.12"],"关键字修饰的枚举":["2.12"],"常量枚举会使用内联语法":["2.12"],"不会为枚举类型编译生成任何":["2.12"],"类型成为了类型系统的顶级类型":["2.13"],"也被称作全局超级类型":["2.13"],"ts":["2.13","2.14","2.15"],"function":["2.15"],"getconsole":["2.15"],"error":["2.16"],"message":["2.16","6.8"],"string":["2.16"],"length":["2.18"],"as":["2.18"],"assignable":["2.19"],"to":["2.19"],"console":["2.21"],"log":["2.21"],"if":["2.21","2.22"],"padding":["2.22"],"return":["2.22"],"yeah":["6.2"],"net":["6.2"],"查看配置信息":["6.2"],"通常情况下":["6.3"],"我们使用commit命令可以将暂存区的文件添加到本地仓库":["6.3"],"远程仓库":["6.3"],"从远程库":["6.4"],"抓取到本地仓库":["6.4"],"不进行任何的合并动作":["6.4"],"一般操作比较少":["6.4"],"pull":["6.4"],"并且将这次删除放入暂存区":["6.7"],"rm":["6.7","8.17"],"提交指定文件到仓库区":["6.8"],"多个文件用空格隔开":["6.8"],"新分支名":["6.9"],"切换到指定分支":["6.9"],"checkout":["6.9"],"push":["6.10"],"origin":["6.10"],"refs":["6.10"],"tags":["6.10"],"source":["6.11"],"commitid":["6.11"],"clean":["6.11"],"输出哪些文件会被删除":["6.11"],"回滚某次提交":["6.12"],"或远程仓库是受保护的":["6.12"],"不允许":["6.12"],"force":["6.12"],"git":["6.13"],"修复完成后":["6.15"],"切换到":["6.15"],"分支":["6.15"],"并完成合并":["6.15"],"最后删除":["6.15"],"switch":["6.15"],"merge":["6.15"],"基本用法":["6.16"],"支持录屏":["7.2"],"导出gif功能":["7.2"],"看着非常舒服":["7.3"],"processone":["7.3"],"直接粘贴行":["7.4"],"将终端快速定位到当前目录":["7.10"],"fig":["7.10"],"当顶部菜单很多的时候":["7.11"],"这个软件就很实用了":["7.11"],"丑但是很好用的解压缩神器":["7.12"],"tencent":["7.14"],"屏幕右边或者角落":["7.15"],"它能够为您储存您在设备上复制您的所有内容":["7.16"],"nrm":["8.1","8.3","8.4","8.5","8.6","8.7"],"npm":["8.2","8.9"],"use":["8.4"],"add":["8.5"],"test":["8.7"],"版本的工具":["8.8"],"版本":["8.10"],"fnm":["8.12"],"shell":["8.13","8.14"],"brew":["8.13"],"为例":["8.14"],"安装指定大版本的最新版本":["8.15"],"rf":["8.17"]},{"1":["2.22","8.11"],"4":["6.15"],"7":["1.7"],"18":["8.15"],"100":["1.10"],"management":["1.0"],"system":["1.0"],"使用标准的":["1.2"],"sql":["1.2","1.6","1.8","1.9","1.11"],"一行":["1.3"],"元组":["1.3"],"或记录":["1.3"],"是一组相关的数据":["1.3"],"root":["1.5"],"数据库":["1.6","1.8","1.9"],"sys":["1.7"],"rows":["1.7"],"varchar":["1.10"],"null":["1.10"],"author":["1.10"],"数据表":["1.11"],"的一个超集":["2.1"],"弱类型":["2.2"],"没有静态类型选项":["2.2"],"最终被编译成":["2.2"],"g":["2.4","8.2","8.9"],"ts":["2.5"],"iserror":["2.7"],"number":["2.8"],"string":["2.9","2.11"],"eugenio":["2.9"],"array":["2.10","2.22"],"boolean":["2.11"],"let":["2.13"],"notsure":["2.13"],"u":["2.14"],"console":["2.15"],"log":["2.15"],"throw":["2.16"],"join":["2.22"],"list":["6.2"],"生成ssh":["6.2"],"key":["6.2"],"remote":["6.3"],"当使用github":["6.3"],"gitee":["6.3"],"拉取":["6.4"],"从远程库拉到本地库":["6.4"],"自动进行合并":["6.4"],"merge":["6.4"],"然后放到到工作区":["6.4"],"相当于fetch":["6.4"],"停止追踪指定文件":["6.7"],"但该文件会保留在工作区":["6.7"],"cached":["6.7"],"分支名":["6.9"],"新建一个分支并切换到该分支":["6.9"],"提交指定标签":["6.10"],"n":["6.11","8.8"],"删除当前目录下所有没有track过的文件":["6.11"],"push":["6.12"],"此时也应该使用revert进行代码回滚":["6.12"],"回滚到某次提交":["6.12"],"rebase":["6.13"],"no":["6.15"],"ff":["6.15"],"merged":["6.15"],"是时候接着回到dev分支干活了":["6.15"],"dev":["6.15"],"bash":["6.16","8.17"],"git":["6.16"],"xnip":["7.2"],"软件支持滚动截图默认有水印":["7.2"],"免费在线流程图思维导图":["7.3"],"可用于原型图":["7.3"],"很方便":["7.4"],"可以在应用商店免费下载":["7.11"],"lemon":["7.14"],"中间":["7.15"],"并将其储存在paste":["7.16"],"install":["8.2","8.9","8.13"],"ls":["8.3"],"npm":["8.4"],"name":["8.5","8.7"],"del":["8.6"],"shell":["8.10"],"删除指定版本":["8.11"],"sudo":["8.11"],"env":["8.14"],"安装指定版本":["8.15"],"且主版本号为":["8.16"],"的最新版本的":["8.16"],"或":["8.17"]},{"0":["1.7"],"4":["2.12"],"5":["2.10"],"6":["2.10"],"7":["6.4"],"8":["2.12"],"40":["1.10"],"123":["2.8","2.11"],"666":["2.13"],"关系数据库管理系统":["1.0"],"应用软件之一":["1.0"],"数据语言形式":["1.2"],"可以运行于多个系统上":["1.2"],"例如一条用户订阅的数据":["1.3"],"主键":["1.3"],"主键是唯一的":["1.3"],"p":["1.5"],"in":["1.7"],"set":["1.7"],"primary":["1.10"],"key":["1.10"],"而且本质上向这个语言添加了可选的静态类型和基于类的面向对象编程":["2.1"],"代码":["2.2"],"使浏览器可以理解":["2.2"],"typescript":["2.4"],"false":["2.7"],"code":["2.9"],"helloworld":["2.11"],"异构枚举":["2.12"],"异构枚举的成员值是数字和字符串的混合":["2.12"],"a":["2.12","2.15"],"b":["2.12","6.9"],"c":["2.12"],"d":["2.12"],"e":["2.12"],"f":["2.12","6.11"],"a1":["2.12"],"a2":["2.12"],"semlinker":["2.13"],"n":["2.14","8.10"],"this":["2.15"],"is":["2.15"],"new":["2.16","2.22"],"const":["2.19"],"onlystring":["2.19"],"error":["2.19","2.22"],"throw":["2.22"],"ssh":["6.2"],"keygen":["6.2"],"t":["6.2"],"rsa":["6.2"],"gitlab等托管我们项目时":["6.3"],"它就是一个远程仓库":["6.3"],"通常我们使用clone命令将远程仓库代码拷贝下来":["6.3"],"push":["6.4"],"推送":["6.4"],"修改完成后":["6.4"],"需要和团队成员共享代码时":["6.4"],"将代码推送到远程仓库":["6.4"],"file":["6.7"],"改名文件":["6.7"],"并且将这个改名放入暂存区":["6.7"],"mv":["6.7"],"file1":["6.8"],"file2":["6.8"],"合并制定分支到当前分支":["6.9"],"remote":["6.10"],"新建一个分支并指向某个标签":["6.10"],"checkout":["6.10"],"删除当前目录下没有track过的文件及文件夹":["6.11"],"df":["6.11"],"删除当前目录下所有没有被track过的文件":["6.11"],"hard":["6.12"],"工作区是干净的":["6.15"],"刚才的工作现场存到哪去了":["6.15"],"用git":["6.15"],"list命令看看":["6.15"],"list":["6.15"],"工作现场还在":["6.15"],"git把stash内容存在某个地方了":["6.15"],"但是需要恢复一下":["6.15"],"有两个办法":["6.15"],"一是用":["6.15"],"cherry":["6.16"],"pick":["6.16"],"需要购买或订阅":["7.2"],"pro":["7.2"],"uml":["7.3"],"bpmn":["7.3"],"终端与vscode命令行的提示":["7.10"],"ubar":["7.11"],"类似windows的底部菜单栏":["7.11"],"全屏宽等功能":["7.15"],"mac的历史记录中":["7.16"],"可选的npm源":["8.3"],"url":["8.5"],"name":["8.6"],"rm":["8.11"],"use":["8.14"],"on":["8.14"],"cd":["8.14"],"指定默认版本":["8.16"],"zsh":["8.17"],"的配置文件中与":["8.17"]},{"1":["8.15"],"8":["6.4"],"21":["8.15"],"more":["1.0"],"mysql使用":["1.0"],"并且支持多种语言":["1.2"],"一个数据表中只能包含一个主键":["1.3"],"你可以使用主键来查询数据":["1.3"],"00":["1.7"],"sec":["1.7"],"engine":["1.10"],"innodb":["1.10"],"default":["1.10","8.16"],"charset":["1.10"],"utf8":["1.10"],"可以直接在浏览器中使用":["2.2"],"泛型方式定义数组":["2.10"],"false":["2.11","2.13"],"e1":["2.12"],"e2":["2.12"],"异构枚举中数字枚举相对字符串枚举多了":["2.12"],"反向映射":["2.12"],"demo":["2.15"],"ignoreundefinedandnull":["2.19"],"ok":["2.19"],"start":["2.21"],"expected":["2.22"],"or":["2.22"],"got":["2.22"],"c":["6.2"],"本地代码更新后":["6.3"],"通过push托送给远程仓库":["6.3"],"reset":["6.4"],"回退":["6.4"],"用于回退版本":["6.4"],"可以指定退回某一次提交的版本":["6.4"],"original":["6.7"],"renamed":["6.7"],"merge":["6.9"],"b":["6.10"],"新分支名":["6.10"],"不管他是否是":["6.11"],"gitignore文件里面指定的文件夹和文件":["6.11"],"xf":["6.11"],"soft":["6.12"],"apply":["6.15"],"恢复":["6.15"],"但是恢复后":["6.15"],"stash内容并不删除":["6.15"],"你需要用":["6.15"],"drop":["6.15"],"来删除":["6.15"],"另一种方式是用":["6.15"],"pop":["6.15"],"恢复的同时把stash内容也删了":["6.15"],"commithash":["6.16"],"版才能去除水印":["7.2"],"网络拓扑图等多种图形绘制":["7.3"],"zshrc":["8.14"],"相关的配置":["8.17"]}]'},n={"0.0":{t:"HTML",p:"",l:"FrontEnd/html.html",a:"html"},"1.0":{t:":::tip",p:"MySQL 是最流行的关系型数据库管理系统，在 WEB 应用方面 MySQL 是最好的 RDBMS(Relational D ...",l:"FrontEnd/mysql.html",a:"tip"},"1.1":{t:"一、基础知识",p:"",l:"FrontEnd/mysql.html#一、基础知识",a:"一、基础知识"},"1.2":{t:"1.1 概念",p:`
MySQL 是开源的，目前隶属于 Oracle 旗下产品。
MySQL 支持大型的数据库。可以处理拥有上千万条记录的大型数 ...`,l:"FrontEnd/mysql.html#_1-1-概念",a:"_1-1-概念"},"1.3":{t:"1.2 RDBMS 术语",p:`!RDMBS

数据库: 数据库是一些关联表的集合。
数据表: 表是数据的矩阵。在一个数据库中的表看起来像一个简单的电子表格 ...`,l:"FrontEnd/mysql.html#_1-2-rdbms-术语",a:"_1-2-rdbms-术语"},"1.4":{t:"二、Mysql使用",p:"",l:"FrontEnd/mysql.html#二、mysql使用",a:"二、mysql使用"},"1.5":{t:"2.1 mysql连接",p:`mysql -u root -p

`,l:"FrontEnd/mysql.html#_2-1-mysql连接",a:"_2-1-mysql连接"},"1.6":{t:"2.2 创建数据库",p:`create database &lt;要创建的数据库名&gt;;


创建 newtable 数据库

create da ...`,l:"FrontEnd/mysql.html#_2-2-创建数据库",a:"_2-2-创建数据库"},"1.7":{t:"2.3 查看已有的数据库",p:`show databases;

控制台会打印出已经创建的数据库
+--------------------+
| Data ...`,l:"FrontEnd/mysql.html#_2-3-查看已有的数据库",a:"_2-3-查看已有的数据库"},"1.8":{t:"2.4 删除数据库",p:`drop database &lt;数据库名&gt;;


删除 newtable 数据库

drop database n ...`,l:"FrontEnd/mysql.html#_2-4-删除数据库",a:"_2-4-删除数据库"},"1.9":{t:"2.5 选择数据库",p:`use &lt;数据库名&gt;


使用 eggapi 数据库

use eggapi;

`,l:"FrontEnd/mysql.html#_2-5-选择数据库",a:"_2-5-选择数据库"},"1.10":{t:"2.6 创建数据表",p:`CREATE TABLE table_name (column_name column_type);


创建名为 newt ...`,l:"FrontEnd/mysql.html#_2-6-创建数据表",a:"_2-6-创建数据表"},"1.11":{t:"2.7 删除数据表",p:`drop table &lt;table_name&gt;;


删除 newtable 数据表

drop table n ...`,l:"FrontEnd/mysql.html#_2-7-删除数据表",a:"_2-7-删除数据表"},"2.0":{t:"# Typescript入门",p:`
`,l:"FrontEnd/typescript.html",a:"typescript入门"},"2.1":{t:"一、 Typescript是什么",p:"TypeScript 是一种由微软开发的自由和开源的编程语言。它是 JavaScript 的一个超集，而且本质上向这个语言添 ...",l:"FrontEnd/typescript.html#一、-typescript是什么",a:"一、-typescript是什么"},"2.2":{t:"1.1 TS与JS的区别",p:`


Typescript
Javascript




JavaScript 的超集用于解决大型项目的代码复杂性
一种脚本 ...`,l:"FrontEnd/typescript.html#_1-1-ts与js的区别",a:"_1-1-ts与js的区别"},"2.3":{t:"1.2 环境配置",p:"",l:"FrontEnd/typescript.html#_1-2-环境配置",a:"_1-2-环境配置"},"2.4":{t:"1. 安装Typescript",p:`npm install -g typescript

`,l:"FrontEnd/typescript.html#_1-安装typescript",a:"_1-安装typescript"},"2.5":{t:"2. 将ts转成js",p:`tsc index.ts

`,l:"FrontEnd/typescript.html#_2-将ts转成js",a:"_2-将ts转成js"},"2.6":{t:"二、Typescript基本类型",p:"",l:"FrontEnd/typescript.html#二、typescript基本类型",a:"二、typescript基本类型"},"2.7":{t:"2.1 Boolean类型",p:`let isSuccess: boolean = true;
let isError: boolean = false;

`,l:"FrontEnd/typescript.html#_2-1-boolean类型",a:"_2-1-boolean类型"},"2.8":{t:"2.2 Number类型",p:`let count: number = 123;

`,l:"FrontEnd/typescript.html#_2-2-number类型",a:"_2-2-number类型"},"2.9":{t:"2.3 String类型",p:`let name: string = 'eugenio code'

`,l:"FrontEnd/typescript.html#_2-3-string类型",a:"_2-3-string类型"},"2.10":{t:"2.4 Array类型",p:`let list: number[] = [1, 2, 3]

let newList: Array&lt;number&g ...`,l:"FrontEnd/typescript.html#_2-4-array类型",a:"_2-4-array类型"},"2.11":{t:"2.5 Tuple类型",p:`
数组一般由同种类型的值组成，但有时我们需要在单个变量中存储不同类型的值，这时候我们就可以使用元组

元组可用于定义具有有限 ...`,l:"FrontEnd/typescript.html#_2-5-tuple类型",a:"_2-5-tuple类型"},"2.12":{t:"2.6 Enum类型",p:`
使用枚举我们可以定义一些带名字的常量。 使用枚举可以清晰地表达意图或创建一组有区别的用例。 TypeScript 支持数字 ...`,l:"FrontEnd/typescript.html#_2-6-enum类型",a:"_2-6-enum类型"},"2.13":{t:"2.7 Any类型",p:`
在 TypeScript 中，任何类型都可以被归为 any 类型。这让 any 类型成为了类型系统的顶级类型（也被称作全局 ...`,l:"FrontEnd/typescript.html#_2-7-any类型",a:"_2-7-any类型"},"2.14":{t:"2.8 Null与Undefined类型",p:`
TypeScript 里，undefined 和 null 两者有各自的类型分别为 undefined 和 null

l ...`,l:"FrontEnd/typescript.html#_2-8-null与undefined类型",a:"_2-8-null与undefined类型"},"2.15":{t:"2.9 Void类型",p:`
void 类型某种程度上是与 any 类型相反的，它表示没有任何类型。当一个函数没有返回值时，通常会见到其返回值类型是 v ...`,l:"FrontEnd/typescript.html#_2-9-void类型",a:"_2-9-void类型"},"2.16":{t:"2.10 Never类型",p:`
never 类型表示的是那些永不存在的值的类型

// 返回never的函数必须存在无法达到的终点
function er ...`,l:"FrontEnd/typescript.html#_2-10-never类型",a:"_2-10-never类型"},"2.17":{t:"三、Typescript 断言",p:"",l:"FrontEnd/typescript.html#三、typescript-断言",a:"三、typescript-断言"},"2.18":{t:"3.1 类型断言",p:`
有时候你会遇到这样的情况，你会比 TypeScript 更了解某个值的详细信息。通常这会发生在你清楚地知道一个实体具有比它 ...`,l:"FrontEnd/typescript.html#_3-1-类型断言",a:"_3-1-类型断言"},"2.19":{t:"3.2 非空断言",p:`
在上下文中当类型检查器无法断定类型时，一个新的后缀表达式操作符 ! 可以用于断言操作对象是非 null 和非 undefi ...`,l:"FrontEnd/typescript.html#_3-2-非空断言",a:"_3-2-非空断言"},"2.20":{t:"四、Typescript 类型守护",p:"",l:"FrontEnd/typescript.html#四、typescript-类型守护",a:"四、typescript-类型守护"},"2.21":{t:"4.1 `in` 关键字",p:`interface Admin {
  name: string;
  privileges: string[];
}

i ...`,l:"FrontEnd/typescript.html#_4-1-in-关键字",a:"_4-1-in-关键字"},"2.22":{t:"4.2 `typeof` 关键字",p:`
typeof 类型保护只支持两种形式：typeof v === &quot;typename&quot; 和 typeof ...`,l:"FrontEnd/typescript.html#_4-2-typeof-关键字",a:"_4-2-typeof-关键字"},"3.0":{t:"Vue",p:"",l:"FrontEnd/vue.html",a:"vue"},"4.0":{t:"# 关于自己",p:`94年出生，文科男一枚,毕业于河南科技大学,稀里糊涂就成了一个前端小菜鸡
`,l:"about.html",a:"关于自己"},"4.1":{t:":sparkles:当下",p:`!当下
`,l:"about.html#sparkles-当下",a:"sparkles-当下"},"4.2":{t:":rocket:未来",p:`!未来
`,l:"about.html#rocket-未来",a:"rocket-未来"},"6.0":{t:"<!-- more -->",p:`Git使用
`,l:"tools/git.html",a:"more"},"6.1":{t:"一、基础知识",p:"",l:"tools/git.html#一、基础知识",a:"一、基础知识"},"6.2":{t:"1.1 git环境配置",p:`

查看git版本
git version



配置个人的用户名称和电子邮件地址：
git config --global ...`,l:"tools/git.html#_1-1-git环境配置",a:"_1-1-git环境配置"},"6.3":{t:"1.2 基本概念",p:`
工作区

本地项目存放文件的位置


暂存区 (Index/Stage)

顾名思义就是暂时存放文件的地方，通过add命令 ...`,l:"tools/git.html#_1-2-基本概念",a:"_1-2-基本概念"},"6.4":{t:"1.3 git工作流程图",p:`!git工作流

命令如下：


clone(克隆): 从远程仓库中克隆代码到本地仓库
checkout(检出): 从本地仓 ...`,l:"tools/git.html#_1-3-git工作流程图",a:"_1-3-git工作流程图"},"6.5":{t:"二、仓库管理",p:"",l:"tools/git.html#二、仓库管理",a:"二、仓库管理"},"6.6":{t:"三、Git常用命令",p:"",l:"tools/git.html#三、git常用命令",a:"三、git常用命令"},"6.7":{t:"3.1 添加/删除文件",p:`# 查看工作区的文件状态
git status

# 添加工作区的所有文件到暂存区
git add .

# 添加指定文件到 ...`,l:"tools/git.html#_3-1-添加-删除文件",a:"_3-1-添加-删除文件"},"6.8":{t:"3.2 提交代码",p:`# 提交代码到仓库区，没有-m会进入vim编辑器
git commit -m 'message'

# 提交指定文件到仓库区 ...`,l:"tools/git.html#_3-2-提交代码",a:"_3-2-提交代码"},"6.9":{t:"3.3 分支",p:`# 查看本地所有分支
git branch

# 查看本地和远程所有分支
git branch -a

# 新建一个分支并停 ...`,l:"tools/git.html#_3-3-分支",a:"_3-3-分支"},"6.10":{t:"3.4 标签",p:`# 查看所以标签
git tag

# 新建一个标签
git tab [xxx]

# 删除本地标签
git tag -d  ...`,l:"tools/git.html#_3-4-标签",a:"_3-4-标签"},"6.11":{t:"3.5 撤销",p:`

git restore
# 撤销工作区tracked过所有文件的修改
git restore .

# git add  ...`,l:"tools/git.html#_3-5-撤销",a:"_3-5-撤销"},"6.12":{t:"3.5 回滚",p:`回滚某次、某个连续的提交，生成新的提交记录。
git revert [commit-id]


场景：提交了错误代码，想要回 ...`,l:"tools/git.html#_3-5-回滚",a:"_3-5-回滚"},"6.13":{t:"3.6 变基",p:`git rebase

`,l:"tools/git.html#_3-6-变基",a:"_3-6-变基"},"6.14":{t:"四、实际业务场景",p:"",l:"tools/git.html#四、实际业务场景",a:"四、实际业务场景"},"6.15":{t:"场景一：Bug分支",p:`
场景描述：当你接到一个修复一个代号101的bug的任务时，很自然地，你想创建一个分支issue-101来修复它，但是，当前 ...`,l:"tools/git.html#场景一-bug分支",a:"场景一-bug分支"},"6.16":{t:"场景二：选择某个提交进行合并",p:`
场景描述：对于多分支的代码库，将代码从一个分支转移到另一个分支是常见需求。
当我们在一个分支上开发了两个功能时，代码快要合 ...`,l:"tools/git.html#场景二-选择某个提交进行合并",a:"场景二-选择某个提交进行合并"},"7.0":{t:"# 自用Mac软件整理",p:"",l:"tools/mac.html",a:"自用mac软件整理"},"7.1":{t:"图像处理",p:"",l:"tools/mac.html#图像处理",a:"图像处理"},"7.2":{t:"截图",p:`

iShot
目前一直在用的截图软件，支持滚动截图、录屏、图钉等


截图
腾讯出的截图软件，就叫「截图」，支持录屏、导出 ...`,l:"tools/mac.html#截图",a:"截图"},"7.3":{t:"画图",p:`

excalidraw
开源软件，人气很高，一直在维护
操作简洁，有很多素材库可直接使用
很棒的手画风格，看着非常舒服

 ...`,l:"tools/mac.html#画图",a:"画图"},"7.4":{t:"图床",p:`

PicGo
目前一直在用的图床工具，图片存储在github仓库，上传成功后会自动生成markdown语法的图片链接，直接 ...`,l:"tools/mac.html#图床",a:"图床"},"7.5":{t:"前端开发软件",p:"",l:"tools/mac.html#前端开发软件",a:"前端开发软件"},"7.6":{t:" 编辑器",p:`

VSCode


Webstorm


`,l:"tools/mac.html#编辑器",a:"编辑器"},"7.7":{t:"接口调试",p:`
Postman

`,l:"tools/mac.html#接口调试",a:"接口调试"},"7.8":{t:"数据库",p:`

Navicat Premium


Robo 3T


`,l:"tools/mac.html#数据库",a:"数据库"},"7.9":{t:"工具",p:"",l:"tools/mac.html#工具",a:"工具"},"7.10":{t:"终端",p:`

iTerm2


OpenInTerminal
开源软件
能够使用VSCode快速打开项目
将终端快速定位到当前目录

 ...`,l:"tools/mac.html#终端",a:"终端"},"7.11":{t:"菜单栏",p:`

Hidden Bar
一个超轻的 MacOS 实用程序，有助于隐藏菜单栏图标,当顶部菜单很多的时候，这个软件就很实用了， ...`,l:"tools/mac.html#菜单栏",a:"菜单栏"},"7.12":{t:"解压缩",p:`

Keka
在App Store里面下载需要30元，在官网免费下载，丑但是很好用的解压缩神器


`,l:"tools/mac.html#解压缩",a:"解压缩"},"7.13":{t:"视频播放器",p:`

IINA
苹果 Mac 平台上最强的好用万能视频播放器


`,l:"tools/mac.html#视频播放器",a:"视频播放器"},"7.14":{t:"系统清理",p:`

Clean My Mac X


Tencent Lemon


`,l:"tools/mac.html#系统清理",a:"系统清理"},"7.15":{t:"分屏",p:`

Magnet
Magnet 一款Mac下的窗口分屏软件，让当前活动窗口快速变换位置到屏幕左边、屏幕右边或者角落，中间，全 ...`,l:"tools/mac.html#分屏",a:"分屏"},"7.16":{t:"剪切板",p:`

Paste
Paste for Mac是Mac平台上一款专业的剪切板记录增强工具,它能够为您储存您在设备上复制您的所有内 ...`,l:"tools/mac.html#剪切板",a:"剪切板"},"8.0":{t:"# 列举一些实用的NPM包",p:"",l:"tools/npm.html",a:"列举一些实用的npm包"},"8.1":{t:"1. 切换`npm`源的工具 —— `nrm`",p:"",l:"tools/npm.html#_1-切换-npm-源的工具-——-nrm",a:"_1-切换-npm-源的工具-——-nrm"},"8.2":{t:"1.1 `nrm`的安装",p:`npm install -g nrm

`,l:"tools/npm.html#_1-1-nrm-的安装",a:"_1-1-nrm-的安装"},"8.3":{t:"1.2 查看可选npm源",p:`nrm ls

!可选的npm源
`,l:"tools/npm.html#_1-2-查看可选npm源",a:"_1-2-查看可选npm源"},"8.4":{t:"1.3 切换npm源",p:`nrm use npm

!切换npm源
`,l:"tools/npm.html#_1-3-切换npm源",a:"_1-3-切换npm源"},"8.5":{t:"1.4 增加npm源",p:`nrm add &lt;name&gt; &lt;url&gt;

`,l:"tools/npm.html#_1-4-增加npm源",a:"_1-4-增加npm源"},"8.6":{t:"1.5 删除npm源",p:`nrm del &lt;name&gt;

`,l:"tools/npm.html#_1-5-删除npm源",a:"_1-5-删除npm源"},"8.7":{t:"1.6 测试npm源速度",p:`nrm test [&lt;name&gt;]

!测试npm源速度
`,l:"tools/npm.html#_1-6-测试npm源速度",a:"_1-6-测试npm源速度"},"8.8":{t:"2. ~~（弃用）切换`node`版本的工具 —— `n`~~",p:"",l:"tools/npm.html#_2-弃用-切换-node-版本的工具-——-n",a:"_2-弃用-切换-node-版本的工具-——-n"},"8.9":{t:"2.1 安装 `n`",p:`npm install -g n

`,l:"tools/npm.html#_2-1-安装-n",a:"_2-1-安装-n"},"8.10":{t:"2.2 查看可用的 `node` 版本",p:`n 

!
`,l:"tools/npm.html#_2-2-查看可用的-node-版本",a:"_2-2-查看可用的-node-版本"},"8.11":{t:"2.3 基本命令",p:`// 稳定版本
n stable
 
// 最新版
n lastest
 
// 指定版本
n 16.15.1

// 删除 ...`,l:"tools/npm.html#_2-3-基本命令",a:"_2-3-基本命令"},"8.12":{t:"3. 切换`node`版本的工具 —— `fnm`",p:"",l:"tools/npm.html#_3-切换-node-版本的工具-——-fnm",a:"_3-切换-node-版本的工具-——-fnm"},"8.13":{t:"3.1 安装 `fnm`",p:`brew install fnm

`,l:"tools/npm.html#_3-1-安装-fnm",a:"_3-1-安装-fnm"},"8.14":{t:"3.2 配置 `fnm` 所需的环境变量到 `bash` 或 `zsh` 配置文件中，以 `zsh`为例",p:`fnm env --use-on-cd &gt;&gt; ~/.zshrc

`,l:"tools/npm.html#_3-2-配置-fnm-所需的环境变量到-bash-或-zsh-配置文件中-以-zsh-为例",a:"_3-2-配置-fnm-所需的环境变量到-bash-或-zsh-配置文件中-以-zsh-为例"},"8.15":{t:"3.3 用 `fnm` 安装 Node",p:`# 安装 LTS 版本
fnm install --lts

# 安装指定大版本的最新版本
fnm install 18

 ...`,l:"tools/npm.html#_3-3-用-fnm-安装-node",a:"_3-3-用-fnm-安装-node"},"8.16":{t:"3.4 通过 `fnm` 来指定 Node 版本",p:`# 使用系统版本
fnm use system

# 使用 fnm 所安装，且版本号为 18.21.1 的 Node 程序
 ...`,l:"tools/npm.html#_3-4-通过-fnm-来指定-node-版本",a:"_3-4-通过-fnm-来指定-node-版本"},"8.17":{t:"3.5 卸载`fnm`",p:`brew uninstall fnm

# 移除 ~/.fnm 目录
rm -rf ~/.fnm

# 移除 .bash 或 ...`,l:"tools/npm.html#_3-5-卸载-fnm",a:"_3-5-卸载-fnm"}},e={previewLength:62,buttonLabel:"Search",placeholder:"Search docs",allow:[],ignore:[]},l={INDEX_DATA:t,PREVIEW_LOOKUP:n,Options:e};export{l as default};
